Repository: UselessJoy/klipper
Catalog: klippy/locales/*/LC_MESSAGES/Klipper.po
Languages: ru

source: stepper_z: position_endstop: %.3f The SAVE_CONFIG command will update the printer config file with the above and restart the printer.
ru: stepper_z: position_endstop: %.3f Команда SAVE_CONFIG обновит файл конфигурации принтера в соответствии с приведенным выше и перезапустит принтер.

source: stepper_z: position_endstop: %.3f New position saved
ru: stepper_z: position_endstop: %.3f Позиция концевика сохранена

source: Z position must be in range [ %.3f ; %.3f ]
ru: Смещение должно быть в диапазоне [ %.3f ; %.3f ]

source: Calibrate a Z endstop
ru: Калибровка концевика по оси Z

source: Nothing to do: Z Offset is 0
ru: Нечего делать: Смещение Z равно 0

source: stepper_a: position_endstop: %.3f stepper_b: position_endstop: %.3f stepper_c: position_endstop: %.3f The SAVE_CONFIG command will update the printer config file with the above and restart the printer.
ru: stepper_a: position_endstop: %.3f stepper_b: position_endstop: %.3f stepper_c: position_endstop: %.3f Команда SAVE_CONFIG обновит файл конфигурации принтера в соответствии с приведенным выше и перезапустит принтер.

source: Adjust the z endstop_position
ru: Отрегулируйте положение Z endstop_position

source: Already in a manual Z probe. Use ABORT to abort it.
ru: Уже в ручной пробе оси Z. Используйте ABORT, чтобы прервать.

source: Starting manual Z probe. Use TESTZ to adjust position. Finish with ACCEPT or ABORT command.
ru: Начинает ручную проба. Используйте TESTZ для регулировки положения. Завершите с помощью команды "ACCEPT" или "ABORT".

source: WARNING: No change in position (reached stepper resolution)
ru: ПРЕДУПРЕЖДЕНИЕ: Положение не меняется (достигнуто шаговое разрешение)

source: WARNING: Reached stepper maximum position
ru: ПРЕДУПРЕЖДЕНИЕ: достигнута максимальная позиция для шагового двигателя

source: WARNING: Reached stepper minimum position
ru: ПРЕДУПРЕЖДЕНИЕ: достигнута минимальная позиция для шагового двигателя

source: Z position: %s --> %.3f <-- %s
ru: Позиция Z: %s --> %.3f <--%s

source: Accept the current Z position
ru: Примите текущее положение Z

source: Manual probe failed! Use TESTZ commands to position the nozzle prior to running ACCEPT.
ru: Сбой ручной пробы! Используйте TESTZ команды для установки сопла перед запуском ACCEPT.

source: Abort manual Z probing tool
ru: Прервать ручную пробу по оси Z

source: Move to new Z height
ru: Переместиться на новую высоту Z

source: No endstop for this manual stepper
ru: Нет концевика для этого шаговика

source: Command a manually configured stepper
ru: Управлять шаговым устройством, настроенным вручную

source: %s: scl_pin and sda_pin must be on same mcu
ru: %s: scl_pin и sda_pin должны быть на одном mcu

source: Set digipot value
ru: Установить значение digipot

source: New value for DIGIPOT = %s, wiper = %.2f
ru: Новое значения для DIGIPOT = %s, wiper = %.2f

source: mcp4451 address must be between 44 and 47
ru: mcp4451 адрес должен быть между 44 и 47

source: Invalid mpu9250 axes_map parameter
ru: Недопустимый параметр mpu9250 axes_map

source: Unable to query mpu9250 fifo
ru: Не удается запросить mpu9250 fifo

source: Invalid mpu id (got %x). This is generally indicative of connection problems (e.g. faulty wiring) or a faulty chip.
ru: Недопустимый идентификатор mpu (получен %x). Как правило, это указывает на проблемы с подключением (например, неисправность проводки) или неисправный чип.

source: multi_pin %s not configured
ru: multi_pin %s не сконфигурирован

source: Can't setup multi_pin %s twice
ru: Не удается дважды настроить multi_pin%s

source: color_order does not match chain_count
ru: color_order не соответствует chain_count

source: Invalid color_order '%s'
ru: Недопустимый color_order '%s'

source: neopixel chain too long
ru: превышено количество светодиодов для neopixel

source: Set the value of an output pin
ru: Установить значение выходного пина

source: Invalid pin value
ru: Недопустимое значение пна

source: Palette 2 is not connected, connect first
ru: Palette 2 не подключен, сначала подключите

source: Palette 2 requires [virtual_sdcard] to work, please add it to your config!
ru: Palette 2 требует в файле конфигурации секцию [virtual_sdcard] для работы, пожалуйста, добавьте его в файл конфигурации!

source: Palette 2 requires [pause_resume] to work, please add it to your config!
ru: Palette 2 требует в файле конфигурации секцию [pause_resume] для работы, пожалуйста, добавьте его в файл конфигурации!

source: Invalid serial port specific for Palette 2
ru: Недопустимый последовательный порт, определенный для Palette 2

source: Connect to the Palette 2
ru: Подключиться к Palette 2

source: Palette 2 serial port is already active, disconnect first
ru: Последовательный порт у Palette 2 уже активен, сначала отключитесь

source: Unable to connect to the Palette 2
ru: Невозможно подключиться к Palette 2

source: Disconnect from the Palette 2
ru: Отключиться от Palette 2

source: Clear the input and output of the Palette 2
ru: Очистить вход и выход Palette 2

source: Cut the outgoing filament
ru: Отрежьте выходящий филамент

source: Automatically load filament through the extruder
ru: Автоматическая загрузка филамента через экструдер

source: Cannot auto load when the Palette 2 is not ready
ru: Не может автоматически загружаться когда Palette 2 не готов

source: No response from Palette 2
ru: Нет ответа от Palette 2

source: Initialize the print, and check connection with the Palette 2
ru: Инициализация печати и проверка соединения с Palette 2

source: Cannot initialize print, palette 2 is not connected
ru: Не получается инициализировать печать, Palette 2 не подключен

source: Palette 2 waiting on user to complete setup
ru: Palette 2 ожидает, чтобы закончить установку

source: Reset print information
ru: Сбросить информацию принтера

source: Incorrect number of arguments for splice command
ru: Неверное количество аргументов для команды соединения

source: Incorrectly formatted splice command
ru: Неправильно отформатированная команда соединения

source: Palette 2 firmware version is too old, update to at least 9.0.9
ru: Версия Palette 2 слишком старая, обновите как минимум до версии 9.0.9

source: Unable to auto load filament, extruder is below minimum temp
ru: Не удается автоматически загрузить филамент, температура экструдера ниже минимальной

source: Pauses the current print
ru: Поставить на паузу текущую печать

source: Print already paused
ru: Принтер уже поставлен на паузу

source: Resumes the print from a pause
ru: Возобновить печать

source: Print is not paused, resume aborted
ru: Печать не поставлена на паузу, возобновление прервано

source: Clears the current paused state without resuming the print
ru: Очистить текущее состояние паузы без возобновления печати

source: Cancel the current print
ru: Отменить текущую печать

source: action:paused
ru: действие: поставить на паузу

source: action:resumed
ru: действие: возобновить

source: action:cancel
ru: действие: отменить

source: Restoring "%s" temperature to %3.1f, this may take some time
ru: Восстановление температуры %sа до %3.1f°, это может занять некоторое время

source: Resume aborted !!! "%s" not hot enough, please heat up again and press RESUME
ru: Возобновление прервано! %s не достаточно нагрет. Пожалуйста, нагрейте снова и нажмите ВОЗОБНОВИТЬ

source: "%s" not hot enough, please heat up again and press RESUME
ru: %s не достаточно нагрет, пожалуйста, нагрейте снова и нажмите ВОЗОБНОВИТЬ

source: Resume aborted !!! "%s" detects no filament, please load filament and press RESUME
ru: Возобновление прервано! %s не обнаружено филамента. Пожалуйста, заправьте филамент и нажмите ВОЗОБНОВИТЬ

source: "%s" detects no filament, please load filament and press RESUME
ru: %s не обнаружено филамента. Пожалуйста, заправьте филамент и нажмите ВОЗОБНОВИТЬ

source: %s, forced by pause_at_layer [%d]
ru: %s, принудительно остановлен функцией pause_at_layer [%d]

source: "%s" not hot enough
ru: %s не достаточно нагрет

source: Printer not homed
ru: Неизвестны начальные координаты

source: Run PID calibration test
ru: Запустить тест PID калибровки

source: pid_calibrate interrupted
ru: Калибровка PID прервана

source: PID parameters: pid_Kp=%.3f pid_Ki=%.3f pid_Kd=%.3f The SAVE_CONFIG command will update the printer config file with these parameters and restart the printer.
ru: Параметры PID: pid_Kp=%.3f pid_Ki=%.3f pid_Kd=%.3f Команда SAVE_CONFIG обновит файл конфигурации принтера с этими параметрами и перезапустит принтер.

source: Heating %s to
ru: Нагрев %sа до

source: End PID calibrate, new data saved
ru: Калибровка PID закончена, новые параметры сохранены

source: Pass slicer info like layer act and total to klipper
ru: Передать информацию слайсера, такую как layer act и total, в klipper

source: Probe already returned
ru: Проба уже возвращена

source: Command to get magnet probe
ru: Взять пробу

source: Command to return magnet probe
ru: Вернуть пробу

source: Adjust magnet probe
ru: Регулировка магнитной пробы

source: Checking coordinates for magnet capture and saving it on success
ru: Сохранение новых координат при успехе захвата пробы по заданным координатам

source: Y coordinate too far from border. Please, return extruder to socket position
ru: Координата по Y слишком далеко от стенки. Пожалуйста, верните экструдер к гнезду пробы

source: Magnet check successfull. New coordinates saved
ru: Проверка захвата успешна. Новые координаты сохранены

source: End adjustment
ru: Закончить регулировку

source: If the probe did not move far enough to trigger, then consider reducing the Z axis minimum position so the probe can travel further (the Z minimum position can be negative).
ru: Если датчик переместился недостаточно далеко для срабатывания, рассмотрите возможность уменьшения минимального положения оси Z, чтобы датчик мог перемещаться дальше (минимальное положение Z может быть отрицательным).

source: Probe virtual endstop only useful as endstop pin
ru: Виртуальный концевой упор зонда полезен только в качестве штифта концевого упора

source: Can not pullup/invert probe virtual endstop
ru: Не удается подтянуть/инвертировать виртуальный конечный упор датчика

source: Must home before probe
ru: Должен отхоумиться перед пробой

source: Timeout during endstop homing
ru: Тайм-аут во время хоуминга концевика

source: probe at %.3f,%.3f is z=%.6f
ru: в пробе x=%.3f, y=%.3f z=%.6f

source: Probe samples exceed samples_tolerance
ru: Сэмплы проб превышают допустимую величину samples_tolerance

source: Probe samples exceed tolerance. Retrying...
ru: Сэмплы проб превышают допустимые значения. Повторяю попытку...

source: Probe Z-height at current XY position
ru: Z-высота пробы в текущем положении XY

source: Result is z=%.6f
ru: Результат z=%.6f

source: Return the status of the z-probe
ru: Вернуть статус z-пробы

source: probe: %s
ru: проба: %s

source: Probe Z-height accuracy at current XY position
ru: Точность измерения Z-высоты пробы в текущем положении XY

source: PROBE_ACCURACY at X:%.3f Y:%.3f Z:%.3f (samples=%d retract=%.3f speed=%.1f lift_speed=%.1f)
ru: PROBE_ACCURACY в X:%.3f Y:%.3f Z:%.3f (samples=%d, retract=%.3f, speed =%.1f, lift_speed =%.1f)

source: probe accuracy results: maximum %.6f, minimum %.6f, range %.6f, average %.6f, median %.6f, standard deviation %.6f
ru: результаты измерения точности: максимальное %.6f, минимальное %.6f, диапазон %.6f, среднее %.6f, медианная %.6f, стандартное отклонение %.6f

source: %s: z_offset: %.3f The SAVE_CONFIG command will update the printer config file with the above and restart the printer.
ru: %s: z_offset: %.3f Команда SAVE_CONFIG обновит файл конфигурации принтера в соответствии с приведенным выше и перезапустит принтер.

source: %s: z_offset: %.3f New position saved
ru: %s: z_offset: %.3f Новая позиция сохранена

source: Calibrate the probe's z_offset
ru: Калибровка пробы z_offset

source: Adjust the probe's z_offset
ru: Регулировка проб z_offset

source: Toolhead moved during probe activate_gcode script
ru: Головка экструдера перемещена во время выполнения скрипта probe activate_gcode

source: Need at least %d probe points for %s
ru: Требуется как минимум %d точек проб для %s

source: horizontal_move_z can't be less thanprobe's z_offset
ru: horizontal_move_z не может быть меньше z_offset проб

source: horizontal_move_z can't be less than probe's z_offset
ru: horizontal_move_z в секции [bed_mesh] не может быть меньше чем z_offset в секции [probe]

source: Possibly Z motor numbering is wrong
ru: Возможно, неправильная нумерация мотора Z

source: Need exactly 4 probe points for quad_gantry_level
ru: Нужно ровно 4 контрольные точки для quad_gantry_level

source: quad_gantry_level requires at least two gantry_corners
ru: для уровня quad_gantry_level требуется как минимум два gantry_corners

source: Conform a moving, twistable gantry to the shape of a stationary bed
ru: Придайте подвижному поворотному порталу форму стационарной кровати

source: Gantry-relative probe points: %s
ru: Портально-относительные точки измерения: %s

source: Actuator Positions:
ru: Положения привода:

source: Average: %0.6f
ru: Среднее значение: %0.6f

source: Aborting quad_gantry_level required adjustment %0.6f is greater than max_adjust %0.6f
ru: Прерывание quad_gantry_level требуемая настройка %0.6f больше, чем max_adjust %0.6f

source: Report the last value of an analog pin
ru: Сообщите последнее значение аналогового вывода

source: ADC object "%s" has value %.6f (timestamp %.3f)
ru: Объект АЦП "%s" имеет значение %.6f (временная метка %.3f)

source: resistance %.3f (with %.0f pullup)
ru: сопротивление %.3f (с подтягиванием %.0f)

source: Report on the status of each endstop
ru: Отчет о состоянии каждой конечной остановки

source: Pin type not supported on replicape
ru: Тип Pin-кода не поддерживается при проверке репликации

source: pca9685 does not support hardware_pwm parameter
ru: pca9685 не поддерживает параметр hardware_pwm

source: Replicape virtual enable pin must be digital_out
ru: Pin для включения виртуальной репликации должен быть digital_out

source: Replicape virtual enable pin can not be inverted
ru: Pin для включения виртуальной репликации не может быть инвертирован

source: Replicape unable to determine pwmchip
ru: Репликации не удается определить pwmchip

source: Unknown replicape pin %s
ru: Неизвестная реплицируемый пин %s

source: Invalid format of axis '%s'
ru: Недопустимый формат оси '%s'

source: Calibrating stoped
ru: Калибровка резонансов прервана

source: Unable to parse axis direction '%s'
ru: Не удается проанализировать направление оси '%s'

source: Disabled [input_shaper] for resonance testing
ru: Отключаю [input_shaper] для тестирования резонансов

source: Testing frequency %.0f Hz
ru: Тестирование частоты %.0f Hz

source: Re-enabled [input_shaper]
ru: Включаю [input_shaper]

source: Autocalibrating %s
ru: Автокалибровка %s

source: Probing point (%.3f, %.3f, %.3f)
ru: Точка пробы (%.3f, %.3f, %.3f)

source: Testing axis %s
ru: Тестирование оси %s

source: %s-axis accelerometer measured no data
ru: На оси %s акселерометр не измерял никаких данных

source: Runs the resonance test for a specifed axis
ru: Запускает тест резонансов для указанной оси

source: Unsupported output '%s', only 'resonances' and 'raw_data' are supported
ru: Неподдерживаемый вывод '%s', поддерживаются только 'resonances' и 'raw_data'

source: No output specified, at least one of 'resonances' or 'raw_data' must be set in OUTPUT parameter
ru: Выходные данные не указаны, по крайней мере, один из "resonances" или "raw_data" должен быть задан в OUTPUT параметре

source: Invalid NAME parameter
ru: Недопустимый параметр NAME

source: Resonances data written to %s file
ru: Данные резонансов записаны в файл %s

source: Simular to TEST_RESONANCES but suggest input shaper config
ru: Аналогично TEST_RESONANCES, но предлагается конфигурация input shaper

source: Unsupported axis '%s'
ru: Неподдерживаемая ось '%s'

source: Calculating the best input shaper parameters for %s axis
ru: Вычисление лучшего параметра input shaper для оси %s

source: Shaper calibration data written to %s file
ru: Данные калибровка shaper записаны в файл %s

source: Measures noise of all enabled accelerometer chips
ru: Измеряет шум у всех включенных акселерометров

source: Axes noise for %s-axis accelerometer: %.6f (x), %.6f (y), %.6f (z)
ru: Шум по оси %s для акселерометра: %.6f (x), %.6f (y), %.6f (z)

source: Frequency, Hz
ru: Частота, Гц

source: Power spectral density
ru: Спектральная плотность мощности

source: Frequency response and shapers (%s)
ru: Частотная характеристика и шейперы (%s)

source: Shaper vibration reduction (ratio)
ru: Коэффициент понижения вибраций

source: %s (%.1f Hz, vibr=%.1f%%, sm~=%.2f, accel<=%.f)
ru: %s (%.1f Гц, вибрации=%.1f%%, сглаживание~=%.2f, ускорение<=%.f)

source: After shaper
ru: После шейпер

source: Recommended shaper: %s
ru: Рекомендуемый шейпер: %s

source: Cannot find graph %s
ru: График %s не найден

source: Graph %s already exist
ru: График %s уже существует

source: Unsupported path for graph %s
ru: Неподдерживаемый путь для графика %s

source: Graph %s doesn't saved
ru: График %s не сохранен

source: Frequency responses comparison
ru: Сравнение частотных характеристик

source: Frequency (Hz)
ru: Частота (Гц)

source: Left belt
ru: Левый ремень

source: Right belt
ru: Правый ремень

source: Invalid POINT parameter, must be 'x,y,z'
ru: Недействительный параметр POINT, должно быть 'x,y,z'

source: Invalid POINT parameter, must be 'x,y,z' where x, y and z are valid floating point numbers
ru: Недействительный параметр POINT, должно быть 'x,y,z' где x, y и z - допустимые числа с плавающей запятой

source: Echo the message prepended with a prefix
ru: Повторите сообщение, дополненное префиксом

source: RESPOND TYPE '%s' is invalid. Must be one of 'echo', 'command', or 'error'
ru: RESPOND TYPE '%s' неверно. Должно быть что-то из 'echo', 'command', или 'error'

source: homing_override and safe_z_homing cannot be used simultaneously
ru: homing_override и safe_z_homing не могут использоваться одновременно

source: Must home X and Y axes first
ru: Необходимо сначала отхоумить X и Y оси

source: %s: SERCOM pins must be on same mcu
ru: %s: SERCOM пины должны быть на одном mcu

source: Unable to parse existing variable file
ru: Не удается проанализировать существующий файл переменных

source: Save arbitrary variables to disk
ru: Сохранение произвольных переменных на диск

source: Unable to save variable
ru: Невозможно сохранить переменную

source: screws_tilt_adjust: Must have at least three screws
ru: screws_tilt_adjust: Должен иметь как минимум три винта

source: Tool to help adjust bed leveling screws by calculating the number of turns to level it.
ru: Инструмент, помогающий отрегулировать винты для выравнивания основания, рассчитав количество оборотов для его выравнивания.

source: Error on '%s': DIRECTION must be either CW or CCW
ru: Ошибка в '%s': DIRECTION должен быть либо CW, либо CCW

source: 01:20 means 1 full turn and 20 minutes, CW=clockwise, CCW=counter-clockwise
ru: 01:20 означает 1 полный оборот и 20 минут, CW = по часовой стрелке, CCW = против часовой стрелки

source: bed level exceeds configured limits ({}mm)! Adjust screws and restart print.
ru: уровень стола превышает заданные пределы ({} мм)! Отрегулируйте винты и перезапустите печать.

source: Stop the current screw calibrating
ru: Прерывает калибровку на текущем винте и переходит к следующему

source: Go to the given screw to calibrate
ru: Переместиться к заданному винту для калибровки

source: Cannot set new calibrating screw: already wait move to next screw %s
ru: Не удалось установить новый калибровочный винт: уже ожидается движение к винту %s

source: Cannot set new calibrating screw: calibration is not performed
ru: Не удалось установить новый калибровочный винт: калибровка не произодится

source: Cannot set new calibrating screw: screw is not defined
ru: Не удалось установить новый калибровочный винт: винт не задан

source: Cannot set new calibrating screw: screw %s is base screw
ru: Не удалось установить новый калибровочный винт: винт %s является базовой точкой

source: Cannot set new calibrating screw: screw %s not in defined screws
ru: Не удалось установить новый калибровочный винт: винта %s в списке винтов не существует

source: Cannot set new calibrating screw: searching highest screw
ru: Не удалось установить новый калибровочный винт: идет поиск базовой точки

source: Set the given screw as base screw
ru: Установить заданный винт как базовую точку

source: Cannot set new base screw: calibration already performed
ru: Не удалось установить новую базовую точку: уже идет калибровка

source: Cannot set new base screw: screw %s is not defined
ru: Не удалось установить новую базовую точку: винта %s в списке винтов не существует

source: Reset base screw
ru: Сбросить базовую точку

source: Cannot reset base screw: calibration already performed
ru: Невозможно сбросить базовую точку: калибровка уже идет

source: Calibrate screws until SCREWS_TILT_CALIBRATE_STOP send or increase minimal deviation of screws
ru: Калибровать винты до тех пор, пока не поступит команда SCREWS_TILT_CALIBRATE_STOP, либо пока не будут достигнуты приемлимые отклонения на всех винтах

source: Successfull calibrated screws!
ru: Винты успешно откалиброваны!

source: Screws calibrating stoped
ru: Калибровка винтов прервана

source: Successfull calibrated screw %s
ru: Успешно откалибровал винт %s

source: Current screw calibrating stoped
ru: Калибровка текущего винта прервана

source: Stop SCREWS_TILT_CALIBRATE command
ru: Прерывает выполнение команды SCREWS_TILT_CALIBRATE

source: Begins a looped section in the SD file.
ru: Запускает зацикленный раздел в SD-файле.

source: Only permitted in SD file.
ru: Разрешено только в SD-файле.

source: Ends a looped section in the SD file.
ru: Завершает зацикленный раздел в SD-файле.

source: Stops iterating the current loop stack.
ru: Останавливает итерацию текущего стека циклов.

source: Only permitted outside of a SD file.
ru: Разрешено только за пределами SD-файла.

source: Set servo angle
ru: Установите угол наклона сервопривода

source: Failed to import `numpy` module, make sure it was installed via `~/klippy-env/bin/pip install` (refer to docs/Measuring_Resonances.md for more details).
ru: Ошибка импорта модуля `numpy`, убедитесь, что он был установлен в `~/klippy-env/bin/pip install` (docs/Measuring_Resonances.md для деталей).

source: Internal error processing accelerometer data %s
ru: Внутренняя ошибка обработки данных акселерометра, %s

source: Error writing to file '%s': %s
ru: Ошибка записи в файл '%s': %s

source: Fitted shaper '%s' frequency = %.1f Hz (vibrations = %.1f%%, smoothing ~= %.3f)
ru: Частота установленного shaper '%s' = %.1f Гц (вибрации = %.1f%%, сглаживание ~= %.3f)

source: To avoid too much smoothing with '%s', suggested max_accel <= %.0f mm/sec^2
ru: Чтобы избежать слишком сильного сглаживания с помощью '%s', рекомендуется использовать max_accel <= %.0f мм/сек^2

source: Report current printer skew
ru: Сообщить о текущем наклоне принтера

source: Current Printer Skew:
ru: Текущий угол наклона:

source: Skew: %.6f radians, %.2f degrees
ru: Угол: %.6f радиан, %.2f градусов

source: Calculate skew from measured print
ru: Вычислить угол по measured print

source: Calculated Skew: %.6f radians, %.2f degrees
ru: Вычисленный угол: %.6f радиан, %.2f градусов

source: Set skew based on lengths of measured object
ru: Установите угол в зависимости от длины измеряемого объекта

source: skew_correction: improperly formatted entry for plane [%s] %s
ru: skew_correction: неправильно отформатированная запись для плоскости [%s] %s

source: skew_correction: Load failed, unknown profile [%s]
ru: skew_correction: Ошибка загрузки, неизвестный профиль [%s]
