Repository: UselessJoy/klipper
Catalog: klippy/locales/*/LC_MESSAGES/Klipper.po
Languages: ru

source: Invalid adxl345 id (got %x vs %x). This is generally indicative of connection problems (e.g. faulty wiring) or a faulty adxl345 chip.
ru: Недопустимый идентификатор adxl345 (получено %x против %x). Как правило, это указывает на проблемы с подключением (например, неисправность проводки) или неисправный чип adxl345.

source: Angle calibration requires numpy module
ru: Для калибровки угла требуется модуль numpy

source: Unable to find TMC driver for %s
ru: Не удается найти TMC драйвер для %s

source: Driver phase not known for %s
ru: Фаза драйвера неизвестна для %s

source: Failed calibration - incomplete sensor data
ru: Неудачная калибровка - неполные данные датчика

source: Calibrate angle sensor to stepper motor
ru: Откалибровать датчик угла наклона шаговика

source: Failed calibration - sensor not updating for each step
ru: Неудачная калибровка - датчик не обновляется для каждого шага

source: angle: stddev=%.3f (%.3f forward / %.3f reverse) in %d queries
ru: угол: stddev=%.3f (%.3f вперед / %.3f назад) в запросах %d

source: Unable to query tle5012b chip
ru: Не удается запросить чип tle5012b

source: Unable to write to tle5012b chip
ru: Не удается записать в чип tle5012b

source: Query low-level angle sensor register
ru: Запрос регистра датчика угла наклона

source: Set low-level angle sensor register
ru: Установка регистра датчика угла наклона

source: Wait for calculations..
ru: Ожидание вычислений...

source: Error in remote calculation: %s
ru: Ошибка при удаленном вычислении: %s

source: Successfull save bed mesh
ru: Сетка стола успешно сохранена

source: profile_%s
ru: Профиль_%s

source: Automatic loaded bed mesh %s
ru: Автоматически установлен профиль %s

source: bed_mesh: malformed '%s' value: %s
ru: bed_mesh: искаженное '%s' значение: %s

source: Option '%s' in section bed_mesh must have a minimum of %s
ru: Параметр '%s' в разделе bed_mesh должен иметь значение не менее %s

source: Unable to parse parameter '%s'
ru: Не удается разобрать параметр %s

source: Parameter '%s' must have a minimum of %d
ru: Параметр '%s' должен иметь значение не менее %d

source: Parameter '%s' must have a maximum of %d
ru: Параметр '%s' должен иметь значение не более %d

source: bed_mesh: ERROR, fade_target lies outside of mesh z range min: %.4f, max: %.4f, fade_target: %.4f
ru: bed_mesh: ОШИБКА, fade_target находится за пределами диапазона z сетки min: %.4f, max: %.4f, fade_target: %.4f

source: bed_mesh: Mesh extends outside of the fade range, please see the fade_start and fade_end options in example-extras.cfg. fade distance: %.2f mesh min: %.4f mesh max: %.4f
ru: bed_mesh: Сетка выходит за пределы диапазона дат, пожалуйста, смотрите параметры fade_start и fade_and в примере-extras.cfg. расстояние затухания: %.2f минимальная сетка: %.4f максимальная сетка: %.4f

source: Mesh Leveling: Error splitting move
ru: Выравнивание сетки: Ошибка при разделении хода

source: Retrieve interpolated grid of probed z-points
ru: Извлекать интерполированную сетку проб z-точек

source: Bed has not been probed
ru: Не была произведена проба стола

source: Serialize mesh and output to terminal
ru: Сериализовать сетку и вывести в терминал

source: Clear the Mesh so no z-adjustment is made
ru: Очистите сетку, чтобы не производить z-регулировку

source: Add X/Y offsets to the mesh lookup
ru: Добавьте смещения X/Y к поиску сетки

source: No mesh loaded
ru: Сетка не загружена

source: Loaded mesh profile: %s
ru: Загруженная сетка стола: %s

source: bed_mesh: min/max points too close together
ru: bed_mesh: минимальное/максимальное количество точек слишком близко друг к другу

source: bed_mesh: generated points Index | Tool Adjusted | Probe
ru: bed_mesh: сгенерированные точки Индекс | Коррект. инструмент | Проба

source: bed_mesh: relative_reference_index %d is (%.2f, %.2f)
ru: bed_mesh: relative_reference_index %d равен (%.2f, %.2f)

source: bed_mesh: faulty region points
ru: bed_mesh: неверные точки пробы

source: %d (%.2f, %.2f), substituted points: %s
ru: %d (%.2f, %.2f), замененные точки: %s

source: bed_mesh: probe_count must be odd for round beds
ru: bed_mesh: probe_count должно быть нечетным для круглых столов

source: bed_mesh: invalid min/max points
ru: bed_mesh: неверные min/max точки

source: bed_mesh: Existing faulty_region_%d %s overlaps added faulty_region_%d %s
ru: bed_mesh: Существующий faulty_region_%d %s перекрывает добавленный faulty_region_%d %s

source: bed_mesh: Added faulty_region_%d %s overlaps existing faulty_region_%d %s
ru: bed_mesh: Добавленный faulty_region_%d %s перекрывает существующий faulty_region_%d %s

source: bed_mesh: cannot exceed a probe_count of 6 when using lagrange interpolation. Configured Probe Count: %d, %d
ru: bed_mesh: не может превышать значение probe_count, равное 6, при использовании интерполяции Лагранжа. Настроенное количество проб: %d, %d

source: bed_mesh: invalid probe_count option when using bicubic interpolation. Combination of 3 points on one axis with more than 6 on another is not permitted. Configured Probe Count: %d, %d
ru: bed_mesh: недопустимый параметр probe_count при использовании бикубической интерполяции. Сочетание 3 точек на одной оси с более чем 6 точками на другой не допускается. Настроенное количество проб: %d, %d

source: Generating new points...
ru: Генерация новых точек...

source: Perform Mesh Bed Leveling
ru: Выравнивание сетки

source: Value for parameter 'PROFILE' must be specified
ru: Необходимо указать значение параметра "PROFILE"

source: bed_mesh: point mismatch, orig = (%.2f, %.2f), probed = (%.2f, %.2f)
ru: bed_mesh: несоответствие точек, исходное значение = (%.2f, %.2f), проверено = (%.2f, %.2f)

source: bed_mesh: Invalid y-axis table length Probed table length: %d Probed Table: %s
ru: bed_mesh: Недопустимая длина таблицы по оси y Длина таблицы проб: %d Таблица проб: %s

source: bed_mesh: incorrect number of points sampled on X
ru: bed_mesh: неверное количество точек, отобранных на X

source: Probed Table:
ru: Таблица проб:

source: bed_mesh: invalid x-axis table length Probed table length: %d Probed Table: %s
ru: bed_mesh: Недопустимая длина таблицы по оси х Длина таблицы проб: %d Таблица проб: %s

source: Mesh Bed Leveling Complete
ru: Выравнивание уровня стола завершено

source: bed_mesh: Slice distance is negative or greater than entire move length
ru: bed_mesh: расстояние среза отрицательно или больше полной длины перемещения

source: Mesh Leveling Probed Z positions:
ru: Выравнивание сетки с апробированными Z позициями :

source: bed_mesh: bed has not been probed
ru: bed_mesh: кровать не была апробирована

source: Mesh X,Y: %d,%d
ru: Сетка X,Y: %d,%d

source: Search Height: %d
ru: Высота поиска: %d

source: Mesh Offsets: X=%.4f, Y=%.4f
ru: Смещения сетки: X=%.4f, Y=%.4f

source: Mesh Average: %.2f
ru: Среднее значение сетки: %.2f

source: Mesh Range: min=%.4f max=%.4f
ru: Диапазон сетки: min =%.4f max =%.4f

source: Interpolation Algorithm: %s
ru: Алгоритм интерполяции: %s

source: Measured points:
ru: Измеренные точки:

source: bed_mesh: Z Mesh not generated
ru: bed_mesh: Z-сетка не сгенерирована

source: bed_mesh: Error finding x control points
ru: bed_mesh: Ошибка при поиске X контрольных точек

source: bed_mesh: Error finding y control points
ru: bed_mesh: Ошибка при поиске Y контрольных точек

source: The following incompatible profiles have been detected and are scheduled for removal: %s The SAVE_CONFIG command will update the printer config file and restart the printer
ru: Были обнаружены следующие несовместимые профили, удаление которых запланировано: %s Команда SAVE_CONFIG обновит файл конфигурации принтера и перезапустит принтер

source: Unable to save to profile [%s], the bed has not been probed
ru: Не удалось сохранить в профиле [%s], слой не был апробирован

source: bed_mesh (add_profile): Profile name already exist [%s]
ru: Калибровка стола: профиль уже существует [%s]

source: bed_mesh (cmd_BED_MESH_CALIBRATE): Profile name already exist [%s]
ru: Калибровка стола (BED_MESH_CALIBRATE): профиль уже существует [%s]

source: Bed Mesh state has been saved to profile [%s].
ru: Состояние сетки стола сохранено в профиле [%s]

source: bed_mesh: Unknown profile [%s]
ru: bed_mesh: Неизвестный профиль [%s]

source: Profile [%s] removed from storage for this session. The SAVE_CONFIG command will update the printer configuration and restart the printer
ru: Профиль [%s] удален из хранилища для этого сеанса. Команда SAVE_CONFIG обновит конфигурацию принтера и перезапустит принтер

source: No profile named [%s] to remove
ru: Нет профиля с именем [%s] для удаления

source: Bed Mesh Persistent Storage management
ru: Управление постоянным хранилищем сетки стола

source: Value for parameter '%s' must be specified
ru: Необходимо указать значение параметра '%s'

source: Profile 'default' is reserved, please chooseanother profile name.
ru: Профиль "default" зарезервирован, пожалуйста, выберите другое имя профиля.

source: Invalid syntax '%s'
ru: Недопустимый синтаксис '%s'

source: screw at %.3f, %.3f
ru: Точка пробы %.3f, %.3f

source: bed_screws: Must have at least three screws
ru: bed_screws: Должно быть не менее трех винтов

source: Adjust %s. Then run ACCEPT, ADJUSTED, or ABORT Use ADJUSTED if a significant screw adjustment is made
ru: Отрегулировать %s. Затем запустите команду ACCEPT, ADJUSTED или ABORT Используйте ADJUSTED, если произведена значительная регулировка винта

source: Tool to help adjust bed leveling screws
ru: Инструмент для регулировки винтов

source: Already in bed_screws helper; use ABORT to exit
ru: Уже в помощнике bed_screws; используйте ABORT для выхода

source: Accept bed screw position
ru: Принять положение винта

source: Bed screws tool completed successfully
ru: Инструмент винтов стола успешно завершен

source: Accept bed screw position after notable adjustment
ru: Примите положение винта стола после заметной регулировки

source: Abort bed screws tool
ru: Отменить инструмент винтов стола

source: Bed tilt calibration script
ru: Скрипт калибровки наклона стола

source: %s The above parameters have been applied to the current session. The SAVE_CONFIG command will update the printer config file and restart the printer.
ru: %s vВышеуказанные параметры были применены к текущей сессии. Команда SAVE_CONFIG обновит файл конфигурации принтера и перезапустит принтер.

source: BLTouch failed to raise probe
ru: BLTouch не удалось поднять пробу

source: Failed to verify BLTouch probe is raised; retrying.
ru: Не удалось проверить, поднят ли сенсорный датчик BLTouch; повторная попытка.

source: BLTouch failed to verify sensor state
ru: BLTouch не удалось проверить состояние датчика

source: ; retrying.
ru: ; повторная попытка.

source: BLTouch failed to deploy
ru: Не удалось развернуть BLTouch

source: Send a command to the bltouch for debugging
ru: Отправьте команду на BLTouch для отладки

source: Sending BLTOUCH_DEBUG COMMAND=%s
ru: Отправка BLTOUCH_DEBUG COMMAND=%s

source: BLTouch commands: %s
ru: Команды BLTouch: %s

source: Store an output mode in the BLTouch EEPROM
ru: Сохраните режим вывода в BLTouch EEPROM

source: BLTouch output modes: 5V, OD
ru: Режимы вывода BLTouch: 5V, OD

source: Storing BLTouch output mode: %s
ru: Сохранение режима вывода BLTouch: %s

source: BME280 temperature %0.1f outside range of %0.1f:%.01f
ru: Температура BME280 %0.1f за пределами диапазона %0.1f:%.01f

source: Must specify %s on mcu '%s'
ru: Необходимо указать %s в mcu '%s'

source: Unknown %s '%s'
ru: Неизвестный %s '%s'

source: %s: spi pins must be on same mcu
ru: %s: контакты spi должны быть на одном mcu

source: button pins must be on same mcu
ru: пины кнопок должны находиться на одном и том же mcu

source: %d steps per detent not supported
ru: %d шагов на фиксатор не поддерживается

source: Duplicate canbus_uuid
ru: Дублирование canbus_uuid

source: Unknown canbus_uuid %s
ru: Неизвестный canbus_uuid %s

source: One or more of these steppers are unknown: %s (valid steppers are: %s)
ru: Один или несколько из этих шаговиков неизвестны: %s (допустимыми шаговиками являются: %s)

source: Update the duration of a delayed_gcode
ru: Обновление длительности delayed_gcode

source: Delta calibrate is only for delta printers
ru: Дельта-калибровка предназначена только для дельта-принтеров

source: The SAVE_CONFIG command will update the printer config file with these parameters and restart the printer.
ru: Команда SAVE_CONFIG обновит файл конфигурации принтера с этими параметрами и перезапустит принтер.

source: Delta calibration script
ru: Скрипт дельта-калибровки

source: Adding manual height: %.3f,%.3f,%.3f is actually z=%.3f
ru: Добавление высоты вручную: %.3f,%.3f,%.3f на самом деле z =%.3f

source: Not all measurements provided
ru: Предоставлены не все измерения

source: Must run basic calibration with DELTA_CALIBRATE first
ru: Сначала необходимо выполнить базовую калибровку с помощью DELTA_CALIBRATE

source: Extended delta calibration tool
ru: Расширенный инструмент для дельта-калибровки

source: Parameter '%s' must have %d values
ru: Параметр '%s' должен иметь значения %d

source: Unknown calibrate action
ru: Неизвестное калибровочное действие

source: Set or clear the display message
ru: Установите или удалите отображаемое сообщение

source: Dotstar pins must be on same mcu
ru: Dotstar пины должны быть на одном mcu

source: Stepper %s phase unknown
ru: шаговый двигатель %s фаза неизвестна

source: Invalid trigger_phase '%s'
ru: Недопустимая trigger_phase '%s'

source: Endstop for %s is not accurate enough for stepper phase adjustment
ru: Концевик для %s недостаточно точен для ступенчатой регулировки фазы

source: Endstop %s incorrect phase (got %d vs %d)
ru: Неправильная фаза Концевика %s (получено %d против %d)

source: Calibrate stepper phase
ru: Калибровка фазы шаговика

source: Stats not available for stepper %s
ru: Статистика недоступна для шаговика %s

source: The SAVE_CONFIG command will update the printer config file with these parameters and restart the printer.
ru: Команда SAVE_CONFIG обновит файл конфигурации принтера с этими параметрами и перезапустит принтер.

source: %s: trigger_phase=%d/%d (range %d to %d)
ru: %s: trigger_phase=%d/%d (диапазон от %d до %d)

source: No steppers found. (Be sure to home at least once.)
ru: Шаговики не найдены. (Обязательно отхоумитесь хотя бы один раз.)

source: Marks the beginning the current object as labeled
ru: Помечает начало текущего объекта как помеченное

source: Marks the end the current object
ru: Отмечает конец текущего объекта

source: EXCLUDE_OBJECT_END called, but no object is currently active
ru: Вызван EXCLUDE_OBJECT_END, но в данный момент ни один объект не активен

source: EXCLUDE_OBJECT_END NAME=%s does not match the current object NAME=%s
ru: EXCLUDE_OBJECT_AND NAME=%s не соответствует текущему имени объекта=%s

source: Cancel moves inside a specified objects
ru: Отмена перемещений внутри указанных объектов

source: There is no current object to cancel
ru: Текущего объекта для отмены нет

source: Provides a summary of an object
ru: Предоставляет сводную информацию об объекте

source: Excluding object {}
ru: Исключающий объект {}

source: Unexcluding object {}
ru: Неисключающий объект {}

source: Known objects: {}
ru: Известные объекты: {}

source: Excluded objects: {}
ru: Исключенные объекты: {}

source: Set fan speed
ru: Задать скорость вращения вентилятора

source: Set manual control for fan. Use it for diagnostic purposes
ru: Установить ручной режим работы вентилятора. Используйте только при диагностике

source: Must set temps and speeds
ru: Необходимо установить температуры и соответствующие для них скорости вентилятора

source: Query the status of the Filament Sensor
ru: Запрос состояния датчика филамента

source: Filament Sensor %s: filament detected
ru: Датчик филамента %s: филамент обнаружен

source: Filament Sensor %s: filament not detected
ru: Датчик филамента %s: филамент не обнаружен

source: Sets the filament sensor on/off
ru: Включает/выключает датчик филамента

source: Set firmware retraction parameters
ru: Установка параметров ретракта

source: Report firmware retraction paramters
ru: Сообщает о параметрах ретракта

source: Unknown stepper %s
ru: Неизвестный шаговый двигатель %s

source: Oscillate a given stepper to help id it
ru: Осциллировать заданный шаговый двигатель, чтобы помочь идентифицировать его

source: Manually move a stepper; invalidates kinematics
ru: Вручную переместить шаговый двигатель; приводит к аннулированию кинематики

source: Force a low-level kinematic position
ru: Принудительно установить позицию кинематики

source: G2/G3 does not support relative move mode
ru: G2/G3 не поддерживает режим относительного перемещения

source: G2/G3 does not support R moves
ru: G2/G3 не поддерживает R перемещение

source: G2/G3 requires IJ, IK or JK parameters
ru: G2/G3 требует IJ, IK или JK параметр

source: Report on the state of a button
ru: Соббщает о статусе кнопки

source: Error loading template '%s': %s
ru: Ошибка загрузки шаблона '%s': %s

source: Error evaluating '%s': %s
ru: Ошибка при вычислении '%s': %s

source: Shutdown due to %s
ru: Отключение из-за %s

source: Name of section '%s' contains illegal whitespace
ru: Название раздела '%s' содержит недопустимые пробелы

source: G-Code macro rename of different types ('%s' vs '%s')
ru: Переименование макросов G-кода разных типов ('%s' против '%s')

source: Option '%s' in section '%s' is not a valid literal
ru: Параметр '%s' в разделе '%s' не является допустимым литералом

source: Set the value of a G-Code macro variable
ru: Устанавливает значение переменной у G-code макроса

source: Unknown gcode_macro variable '%s'
ru: Неизвестная gcode_macro переменная '%s'

source: Unable to parse '%s' as a literal
ru: Не удается разобрать '%s' как литерал

source: Macro %s called recursively
ru: Макрос %s вызывается рекурсивно

source: G-Code move transform already specified
ru: Изменение G-Code move уже задано

source: Invalid speed in '%s'
ru: Недопустимая скорость в '%s'

source: Unable to parse move '%s'
ru: Невозможно разобрать движение '%s'

source: Machine does not support G20 (inches) command
ru: Принтер не поддерживает команду G20 (дюймы)

source: Set a virtual offset to g-code positions
ru: Установите виртуальное смещение для позиций g-кода

source: Save G-Code coordinate state
ru: Сохранение состояния координат G-кода

source: Restore a previously saved G-Code state
ru: Восстановить ранее сохраненное состояние G-кода

source: Unknown g-code state: %s
ru: Неизвестное состояние g-кода: %s

source: Return information on the current location of the toolhead
ru: Возвращает информацию о текущем положении головки экструдера

source: Printer not ready
ru: Принтер не готов

source: Filament width:%.3f
ru: Ширина филамента:%.3f

source: Filament dia (measured mm):
ru: Диаметр филамента (измеренный мм):

source: Filament width measurements cleared!
ru: Измерения ширины филамента выполнены правильно!

source: Filament width sensor Turned On
ru: Датчик ширины филамента включен

source: Filament width sensor is already On
ru: Датчик ширины филамента уже включен

source: Filament width sensor Turned Off
ru: Датчик ширины филамента выключен

source: Filament width sensor is already Off
ru: Датчик ширины филамента уже выключен

source: Filament width logging Turned On
ru: Логгирование ширины филамента включено

source: Filament width logging Turned Off
ru: Логгирование ширины филамента выключено

source: Requested temperature (%.1f) out of range (%.1f:%.1f)
ru: Запрошенная температура (%.1f) выходит за пределы диапазона (%.1f:%.1f)

source: Sets a heater temperature
ru: Устанавливает температуру нагревателя

source: Cannot load config '%s'
ru: Невозможно загрудить конфигурацию '%s'

source: Heater %s already registered
ru: Нагреватель %s уже зарегистрирован

source: Unknown heater '%s'
ru: Неизвестный нагреватель '%s'

source: Unknown temperature sensor '%s'
ru: Неизвестный датчик температуры '%s'

source: G-Code sensor id %s already registered
ru: G-code датчик id %s уже зарегистрирован

source: Turn off all heaters
ru: Выключение всех нагревателей

source: Wait for a temperature on a sensor
ru: Ожидание заданной температуры

source: Error on 'TEMPERATURE_WAIT': missing MINIMUM or MAXIMUM.
ru: Ошибка в 'TEMPERATURE_WAIT': потерян MINIMUM или MAXIMUM.

source: One or more of these heaters are unknown: %s
ru: Один или больше из этих нагревателей неизвестен: %s

source: One or more of these steppers are unknown: %s
ru: Один или больше из этих шаговиков неизвестен: %s

source: Error during homing move: %s
ru: Ошибка во время движения на базовую позицию: %s

source: Communication timeout during homing %s
ru: Тайм-аут связи во время движения на базовую позицию %s

source: No trigger on %s after full movement
ru: Нет триггера на %s после движения

source: Endstop %s still triggered after retract
ru: Концевик %s до сих пор затриггерен после ретракта

source: Homing failed due to printer shutdown
ru: Хоуминг прерван из-за отключения принтера

source: Probing failed due to printer shutdown
ru: Апробирование прервано из-за отключения принтера

source: Probe triggered prior to movement
ru: Ошибка срабатывания датчика калибровки

source: Has active magnet probe. Take off it manually
ru: Подключена магнитная проба. Верните пробу в держатель на стенке

source: Invalid HTU21D Resolution. Valid are %s
ru: Недопустимое разрешение HTU21D. Допустимыми являются %s

source: HTU21D temperature %0.1f outside range of %0.1f:%.01f
ru: Температура HTU21D %0.1f за пределами диапазона %0.1f:%.01f

source: Set the idle timeout in seconds
ru: Устанавливает время ожидания в секундах

source: idle_timeout: Timeout set to %.2f s
ru: idle_timeout: Время ожидания установлено в %.2f с

source: Unsupported shaper type: %s
ru: Неподдерживаемый тип shaper: %s

source: Failed to configure shaper(s) %s with given parameters
ru: Ошибка при конфигурации shaper(-s) %s с заданными параметрами

source: Set cartesian parameters for input shaper
ru: Установка декартовых параметров для input shaper

source: Stops all led_effects
ru: Остановка всех led_effects

source: Unknown LED '%s'
ru: Неизвестный LED '%s'

source: Starts or Stops the specified led_effect
ru: Запускает или останавливает указанный led_effect

source: LED Effect '%s' in section '%s' is not a valid effect layer
ru: LED Effect '%s' в разделе '%s' не является допустимым слоем эффекта

source: Blending mode '%s' in section '%s' is not a valid blending mode
ru: Режим наложения "%s" в разделе "%s" не является допустимым режимом наложения

source: Color %s has too many elements.
ru: Цвет %s имеет слишком много элементов.

source: Error parsing palette in '%s' for layer "%s": %s
ru: Ошибка при разборе палитры '%s' для слоя "%s": %s

source: Get the current default color of neopixel
ru: Получить текущий цвет по умолчанию для neopixel

source: Save default neopixel color
ru: Сохранить текущий цвет по умолчанию

source: Unable to load colors
ru: Ошибка при загрузке цветов

source: New default color saved successfully
ru: Новый цвет по умолчанию успешно сохранен

source: Set the color of an LED
ru: Установить цвет для LED

source: Unknown display_template '%s'
ru: Неизвестный display_template '%s'

source: Invalid display_template parameter: %s
ru: Недопустимый параметр для display_template: %s

source: No LED pin definitions found in '%s'
ru: В '%s' не найдено определений выводов светодиодов

source: Assign a display_template to an LED
ru: Назначить display_template светодиоду

source: LM75 temperature %0.1f outside range of %0.1f:%.01f
ru: Температура LM75 %0.1f за пределами диапазона %0.1f:%.01f

source: Start manual probe helper script
ru: Запустить скрипт ручной пробы
