Repository: UselessJoy/klipper
Catalog: klippy/locales/*/LC_MESSAGES/Klipper.po
Languages: ru

source: Skew Correction state has been saved to profile [%s] for the current session. The SAVE_CONFIG command will update the printer config file and restart the printer.
ru: Состояние коррекции угла сохранено в профиле [%s] для текущей сессии. Команда SAVE_CONFIG обновит файл конфигурации принтера и перезапустит принтер.

source: skew_correction: No profile named [%s] to remove
ru: skew_correction: нет профиля с именем [%s] для удаления

source: Set SmartEffector parameters
ru: Установить параметры SmartEffector

source: sensitivity: %d
ru: чувствительность: %d

source: control_pin must be set in [smart_effector] for sensitivity programming
ru: control_pin должен быть установлен в [smart_effector] для программирования чувствительности

source: probing accelartion: %.3f
ru: ускорение пробы: %.3f

source: probing acceleration control disabled
ru: управление ускорением пробы отключено

source: probe recovery time: %.3f
ru: время восстановления пробы: %.3f

source: probe recovery time disabled
ru: отключено время восстановления пробы

source: Reset SmartEffector settings (sensitivity)
ru: Сбросить настройки SmartEffector (чувствительность)

source: SmartEffector sensitivity was reset
ru: SmartEffector чувствительность была сброшена

source: Enable/disable individual stepper by name
ru: Включение/выключение отдельного шаговика по имени

source: SET_STEPPER_ENABLE: Invalid stepper "%s"
ru: SET_STEPPER_ENABLE: Недопустимый шаговый двигатель "%s"

source: Unknown stepper '%s'
ru: Неизвестный шаговый двигатель '%s'

source: Wrong pin or incompatible type: %s with type %s!
ru: Неправильный пин или несовместимый тип: %s с типом %s!

source: SX1509 pins are not suitable for heaters
ru: SX1509 пины не подходят для нагревателей

source: SX1509_pwm must have hardware_pwm enabled
ru: SX1509_pwm должен иметь включенный hardware_pwm

source: Sets a temperature fan target and fan speed limits
ru: Устанавливает заданную температуру вентилятора и ограничения скорости вращения вентилятора

source: Requested min speed (%.1f) is greater than max speed (%.1f)
ru: Запрошенная минимальная скорость (%.1f) больше максимальной скорости (%.1f)

source: Requested min speed (%.1f) out of range (0.0 : 1.0)
ru: Запрошенная минимальная скорость (%.1f) вне диапазона (0.0 : 1.0)

source: Requested max speed (%.1f) out of range (0.0 : 1.0)
ru: Запрошенная максимальная скорость (%.1f) вне диапазона (0.0 : 1.0)

source: Unable to open temperature file '%s'
ru: Не удается открыть файл температуры '%s'

source: HOST temperature %0.1f below minimum temperature of %0.1f.
ru: Температура основного устройства на %0.1f ниже минимальной температуры на %0.1f.

source: HOST temperature %0.1f above maximum temperature of %0.1f.
ru: Температура основного устройства на %0.1f выше максимальной температуры на %0.1f.

source: High CPU temperature. Check the cooling of the electronics compartment or shutdown
ru: Высокая температура ЦПУ. Проверьте охлаждение отсека электроники или завершите работу

source: MCU temperature not supported on %s
ru: Температура mcu не поддерживается на %s

source: TMC mux pins must be on the same mcu
ru: TMC мультиплексирующие пины должны быть на одном mcu

source: Shared TMC uarts must use the same pins
ru: Для общих TMC uarts должны использовать одни и те же пины

source: Shared TMC uarts need unique address or select_pins polarity
ru: Для общих TMC uarts должны иметь уникальные адреса или select_pins полярность

source: TMC uart rx and tx pins must be on the same mcu
ru: Контакты TMC uart rx и tx должны быть подключены к одному и тому же mcu

source: Unable to read tmc uart '%s' register %s
ru: Невозможно прочитать tmc uart '%s' регистр %s

source: Unable to write tmc uart '%s' register %s
ru: Невозможно записать в tmc uart '%s' регистр %s

source: TMC '%s' reports error: %s
ru: TMC '%s' сообщает об ошибке: %s

source: Initialize TMC stepper driver registers
ru: Инициализировать регистры шагового драйвера TMC

source: Set a register field of a TMC driver
ru: Установите поле регистрации драйвера TMC

source: Unknown field name '%s'
ru: Неизвестное имя поля '%s'

source: Set the current of a TMC driver
ru: Установить текущий ток TMC драйвера

source: Run Current: %0.2fA
ru: Текущий ток: %0.2fA

source: Run Current: %0.2fA Hold Current: %0.2fA
ru: Текущий ток: %0.2fA Удерживать текущий: %0.2fA

source: Read and display TMC stepper driver registers
ru: Считывание и отображение регистров шаговика драйвера TMC

source: ========== Write-only registers ==========
ru: ========== Регистры только для записи ==========

source: ========== Queried registers ==========
ru: ========== Запрашиваемые регистры ==========

source: tmc virtual endstop only useful as endstop
ru: виртуальный tmc endstop полезен только как endstop

source: Can not pullup/invert tmc virtual pin
ru: Не удается подтянуть/инвертировать виртуальный pin tmc

source: tmc virtual endstop requires diag pin config
ru: для виртуального концевика tmc требуется конфигурация diag pin

source: Could not find config section '[%s]' required by tmc driver
ru: Не удалось найти раздел конфигурации "[%s]", требуемый для драйвера tmc

source: TMC SPI chain must have same length
ru: Цепочка TMC SPI должна иметь одинаковую длину

source: TMC SPI chain can not have duplicate position
ru: Цепочка TMC SPI не может иметь повторяющейся позиции

source: Unable to write tmc spi '%s' register %s
ru: Не удалось записать в tmc spi '%s' регистр %s

source: driver_HEND + driver_HSTRT must be <= 15
ru: driver_HEND + driver_HSTRT должен быть <= 15

source: Filament NOT present
ru: Филамент ОТСУТСТВУЕТ

source: Tool to adjust a parameter at each Z height
ru: Инструмент для настройки параметра на каждой высоте Z

source: Cannot specify both FACTOR and STEP_DELTA/STEP_HEIGHT
ru: Невозможно указать как FACTOR, так и STEP_DELTA/STEP_HEIGHT

source: Must specify both STEP_DELTA and STEP_HEIGHT
ru: Необходимо указать как STEP_DELTA, так и STEP_HEIGHT

source: Starting tuning test (
ru: Запуск теста настройки (

source: Ending tuning test mode
ru: Завершение тестового режима настройки

source: See the 'verify_heater' section in docs/Config_Reference.md for the parameters that control this check.
ru: Смотрите раздел "verify_heater" в docs/Config_Reference.md для параметров, которые управляют этой проверкой.

source: Heater %s not heating at expected rate
ru: Нагреватель %s не нагревается с ожидаемой скоростью

source: Printing is paused. Must close doors and hood
ru: Печать приостановлена. Крышка и дверцы должны быть закрыты

source: Some fans was manually installed, it was offed
ru: Некоторые вентиляторы были в ручном режиме - ручной режим был отключен

source: Printing with PLA filament. Please, turn on camera fan or disable safety printing and open doors or hood
ru: Печать с PLA филаментом. Пожалуйста, включите вентиляцию камеры или откройте дверцы либо крышку, предварительно отключив безопасную печать (если она включена)

source: Printing is paused. Must close doors
ru: Печать приостановлена. Необходимо закрыть дверцы

source: Printing is paused. Must close hood
ru: Печать приостановлена. Необходимо закрыть крышку

source: All closed
ru: Крышка и дверцы закрыты

source: Hood open
ru: Крышка открыта

source: Doors are open
ru: Дверцы открыты

source: Doors and hood are open
ru: Дверцы и крышка открыты

source: Unable to get file list
ru: Не удается получить список файлов

source: SD busy
ru: SD занят

source: SD write not supported
ru: SD запись не поддерживается

source: Clears a loaded SD File. Stops the print if necessary
ru: Очищает загруженный SD-файл. При необходимости останавливает печать

source: SDCARD_RESET_FILE cannot be run from the sdcard
ru: SD CARD_RESET_FILE не может быть запущен с SD-карты

source: Loads a SD file and starts the print. May include files in subdirectories.
ru: Загружает SD-файл и запускает печать. Может содержать файлы в подкаталогах.

source: Restart file
ru: Перезапустить файл

source: Remove interrupted file
ru: Удалить прерванный файл

source: Begin file list
ru: Начальный список файлов

source: End file list
ru: Конечный список файлов

source: SD card ok
ru: SD-карта в порядке

source: Unable to open file
ru: Невозможно открыть файл

source: File opened:%s Size:%d
ru: Файл открыт:%s Размер:%d

source: File selected
ru: Файл выбран

source: Not SD printing.
ru: Не печать с SD-карты.

source: SD printing byte %d/%d
ru: SD печатаемый байт %d/%d

source: Done printing file
ru: Завершение печати

source: begin gcode not ended
ru: начальный gcode не завершен

source: Called after all printer objects are instantiated
ru: Вызывается после создания экземпляров всех объектов принтера

source: Set reference temperature after Z homing.
ru: Установите контрольную температуру после наведения по Z.

source: Z adjustment calculation
ru: Z расчет корректировки

source: Remove Z adjustment
ru: Удаление регулировки Z

source: Called everytime the Z adjust thermistor is read
ru: Вызывается каждый раз, когда считывается значение термистора Z adjust

source: enable: %s temp_coeff: %f mm/degC ref_temp: %.2f degC%s ------------------- Current Z temp: %.2f degC Applied Z adjustment: %.4f mm
ru: enable: %s temp_coeff: %f мм/градC ref_temp: %.2f градC%s ------------------- Текущая температура Z: %.2f градC Примененная регулировка Z: %.4f мм

source: Set/query Z Thermal Adjust parameters.
ru: Установите/запросите температурные параметры Z.

source: 1 (enabled)
ru: 1 (включен)

source: 0 (disabled)
ru: 0 (выключен)

source: (manual)
ru: (ручной)

source: %s z_positions needs exactly %d items
ru: для %s z_positions требуется ровно %d элементов

source: %s requires multiple z steppers
ru: %s требуется несколько z-шаговиков

source: Making the following Z adjustments: %s
ru: Выполняем следующие Z-настройки: %s

source: Retries: %d/%d %s: %0.6f tolerance: %0.6f
ru: Повторные попытки: %d/%d %s: %0.6f допуск: %0.6f

source: Retries aborting: %s is increasing. %s
ru: Повторить прерывание: %s увеличивается. %s

source: Too many retries
ru: Слишком много повторных попыток

source: Adjust the Z tilt
ru: Регулировка угла наклона Z

source: Heating with the wait parameter, gcodes will be processed after warming up
ru: Нагрев с параметром 'wait', g-коды будут обработаны после разогрева

source: Printing is paused. Printing will be continued after closing doors and hood
ru: Печать поставлена на паузу. Она продолжится, как только двери и крышка будут закрыты

source: Printer already go to pause
ru: Принтер уже идет в паузу

source: Printer already wait go to resume
ru: Принтер уже продолжает печать

source: New default color was successfully saved
ru: Цвет подсветки по умолчанию успешно сохранен

source: Couldn't take probe
ru: Не удалось взять пробу

source: Couldn't return probe
ru: Не удалось вернуть пробу

source: Current update has system fixes. Please, wait for install
ru: В обновлении имеются системные исправления. Пожалуйста, дождитесь их утановки

source: System updates requiring the internet. Please, connect to the internet
ru: Системные исправления требуют доступ к интернету. Пожалуйста, подключитесь к интернету

source: Installed updates requiring reboot. Please, reboot the system
ru: Установленные исправления требуют перезагрузки. Пожалуйста, перезагрузите систему

source: Fix updates was installed
ru: Исправления установлены
