Repository: UselessJoy/klipper
Catalog: klippy/locales/*/LC_MESSAGES/Klipper.po
Languages: ru

source: Printer is ready
ru: Принтер готов

source: extruder
ru: экструдер

source: heater_bed
ru: стол

source: Hello
ru: Привет

source: Printer is not ready. The klippy host software is attempting to connect. Please retry in a few moments.
ru: Принтер не готов. Программное обеспечение klippy host пытается подключиться. Пожалуйста, повторите попытку через несколько минут.

source: Once the underlying issue is corrected, use the "RESTART" command to reload the config and restart the host software. Printer is halted
ru: Как только проблема будет устранена, используйте команду "RESTART", чтобы перезагрузить конфигурацию и ПО. Принтер приостановлен

source: This is frequently caused by running an older version of the firmware on the MCU(s). Fix by recompiling and flashing the firmware.
ru: Часто эта ошибка вызвана из-за использования старой версии прошивки микроконтроллера. Ее можно устранить, перекомпилировав и установив новую версию прошивки.

source: Once the underlying issue is corrected, use the "RESTART" command to reload the config and restart the host software.
ru: Как только проблема будет устранена, используйте команду "RESTART", чтобы перезагрузить конфигурацию и ПО.

source: Once the underlying issue is corrected, use the "FIRMWARE_RESTART" command to reset the firmware, reload the config, and restart the host software. Error configuring printer
ru: После устранения основной проблемы используйте команду "FIRMWARE_RESTART", чтобы сбросить прошивку, перезагрузить конфигурацию и перезапустить программное обеспечение хоста. Ошибка конфигурирования принтера

source: Once the underlying issue is corrected, use the "FIRMWARE_RESTART" command to reset the firmware, reload the config, and restart the host software. Printer is shutdown
ru: После устранения основной проблемы используйте команду "FIRMWARE_RESTART" для сброса микропрограммы, перезагрузки конфигурации и перезапуска главного программного обеспечения. Принтер выключен

source: Unhandled exception during run
ru: Необработанное исключение во время выполнения

source: Printer object '%s' already created
ru: Объект принтера '%s' уже создан

source: Unknown config object '%s'
ru: Неизвестный объект конфигурации '%s'

source: Unable to load module '%s'
ru: Невозможно загрузить модуль '%s'

source: MCU Protocol error
ru: Ошибка протокола MCU

source: Your Klipper version is: %s
ru: Ваша версия Клиппера: '%s'

source: MCU(s) which should be updated:
ru: MCU(s) которые необходимо обновить:

source: Up-to-date MCU(s):
ru: Актуальная версия прошивки MCU:

source: Internal error during connect: %s %s
ru: Внутренняя ошибка во время подключения: %s %s

source: Internal error during ready callback: %s
ru: Внутренняя ошибка во время коллбэка: %s

source: Error on '%s': missing %s
ru: Ошибка в '%s': потерян %s

source: Error on '%s': unable to parse %s
ru: Ошибка в '%s': не удается разобрать %s

source: Error on '%s': %s must have minimum of %s
ru: Ошибка в '%s': %s должен иметь минимум %s

source: Error on '%s': %s must have maximum of %s
ru: Ошибка в '%s': %s должен иметь максимум %s

source: Error on '%s': %s must be above %s
ru: Ошибка в '%s': %s должно быть выше %s

source: Error on '%s': %s must be below %s
ru: Ошибка в '%s': %s должно быть ниже %s

source: gcode command %s already registered
ru: команда %s уже зарегистрирована

source: mux command %s %s %s may have only one key (%s)
ru: максимальная команда %s %s %s может содержать только один ключ (%s)

source: mux command %s %s %s already registered (%s)
ru: мультиплексная команда %s %s %s уже зарегистрирована (%s)

source: Internal error on command:"%s"
ru: Внутренняя ошибка при выполнении команды: "%s"

source: Klipper state: %s
ru: Статус Клиппера: %s

source: Malformed command '%s'
ru: Неверно сформированная команда '%s'

source: Unknown command:"%s"
ru: Неизвестная команда: "%s"

source: The value '%s' is not valid for %s
ru: Значение '%s' недопустимо для %s

source: Reload config file and restart host software
ru: Перезагружает конфигурационный файл и перезапускает программное обеспечение хоста

source: Restart firmware, host, and reload config
ru: Перезапускает прошивку, ПО хоста и конфигурационный файл

source: Report the printer status
ru: Сообщает о состоянии принтера

source: Klipper state: Not ready
ru: Статус Клиппера: не готов

source: Report the list of available extended G-Code commands
ru: Сообщает список доступных расширенных команд G-Code

source: Printer is not ready - not all commands available.
ru: Принтер не готов - доступны не все команды.

source: Available extended commands:
ru: Доступные расширенные команды:

source: Dumping gcode input %d blocks
ru: Сброс блоков ввода gcode %d

source: Read %f: %s
ru: Считано %f: %s

source: Backup file not found
ru: Бэкап не найден

source: Create backup config
ru: Создает бэкап конфигурации

source: Option '%s' in section '%s' must be specified
ru: Необходимо указать параметр '%s' в разделе '%s'

source: No data changed
ru: Нечего сохранять

source: Unable to parse option '%s' in section '%s'
ru: Не удается разобрать параметр '%s' в разделе '%s'

source: Option '%s' in section '%s' must have minimum of %s
ru: Параметр "%s" в разделе "%s" должен содержать минимум %s

source: Option '%s' in section '%s' must have maximum of %s
ru: Параметр '%s' в разделе '%s' должен содержать максимум %s

source: Option '%s' in section '%s' must be above %s
ru: Параметр "%s" в разделе "%s" должен быть выше %s

source: Option '%s' in section '%s' must be below %s
ru: Параметр "%s" в разделе "%s" должен быть ниже %s

source: Choice '%s' for option '%s' in section '%s' is not a valid choice
ru: Выбор '%s' для параметра '%s' в разделе '%s' является недопустимым

source: Option '%s' in section '%s' must have %d elements
ru: Параметр '%s' в разделе '%s' должен содержать элементы %d

source: Option '%s' in section '%s' is deprecated.
ru: Опция '%s' в разделе '%s' устарела.

source: Value '%s' in option '%s' in section '%s' is deprecated.
ru: Значение '%s' в опции '%s' в разделе '%s' устарело.

source: Unable to open config file %s
ru: Не удается открыть конфигурационный файл %s

source: Include file '%s' does not exist
ru: Включаемый файл '%s' не существует

source: Recursive include of config file '%s'
ru: Рекурсивное включение конфигурационного файла '%s'

source: Section '%s' is not a valid config section
ru: Раздел '%s' не является допустимым разделом конфигурации

source: Option '%s' is not valid in section '%s'
ru: Опция '%s' недопустима в разделе '%s'

source: SAVE_CONFIG section '%s' option '%s' conflictswith included value
ru: SAVE_CONFIG в разделе '%s' параметра '%s' конфликтует с включенным значением

source: Overwrite config file and restart
ru: Перезаписывает конфигурационный файл и перезапускает Клиппер

source: Unable to parse existing config on SAVE_CONFIG
ru: Не удается разобрать существующую конфигурацию во время исполнения SAVE_CONFIG

source: Unable to write config file during SAVE_CONFIG
ru: Не удалось записать конфигурационный файл во время исполнения SAVE_CONFIG

source: Working on calibration...
ru: Работаю над калибровкой...

source: Error in coordinate descent: %s
ru: Ошибка при снижении координат: %s

source: Multi-mcu homing not supported on multi-mcu shared axis
ru: Multi-MCU парковка не поддерживается на общей оси Multi-MCU

source: Static pin can not have shutdown value
ru: Статический pin не может иметь значения отключения

source: Pin with max duration must have start value equal to shutdown value
ru: Pin с максимальной длительностью должен иметь начальное значение, равное значению отключения

source: Digital pin max duration too large
ru: Максимальная задержка digital pin слишком длинная

source: PWM pin max duration too large
ru: Максимальная задержка PWM pin слишком длинная

source: shutdown value must be 0.0 or 1.0 on soft pwm
ru: значение отключения должно быть равно 0.0 или 1.0 при плавном ШИМ

source: PWM pin cycle time too large
ru: Время цикла PWM pin слишком длинное

source: PWM cycle time too large
ru: Слишком большое время цикла ШИМ

source: Timeout on wait for '%s' response
ru: Время ожидания ответа '%s' истекло

source: Attempt MCU '%s' restart failed
ru: Попытка перезапуска MCU '%s' завершилась неудачей

source: MCU '%s' CRC does not match config
ru: MCU '%s' CRC не соответствует конфигурации

source: Pin '%s' is not a valid pin name on mcu '%s'
ru: Pin '%s' не является допустимым именем для mcu '%s'

source: Can not update MCU '%s' config as it is shutdown
ru: Не удается обновить конфигурацию MCU '%s', так как он выключен

source: Unable to configure MCU '%s'
ru: Не удается сконфигурировать MCU '%s'

source: Too few moves available on MCU '%s'
ru: Слишком мало ходов доступно на MCU '%s'

source: pin type %s not supported on mcu
ru: тип pin %s не поддерживается в mcu

source: Internal error in MCU '%s' stepcompress
ru: Внутренняя ошибка MCU '%s' stepcompress

source: Lost communication with MCU '%s'
ru: Потеряна связь с MCU '%s'

source: MCU '%s' spontaneous restart
ru: Самопроизвольный перезапуск MCU '%s'

source: Previous MCU '%s' shutdown:
ru: Предыдущее отключение MCU '%s':

source: MCU '%s' shutdown:
ru: Отключение MCU '%s':

source: This often indicates the host computer is overloaded. Check for other processes consuming excessive CPU time, high swap usage, disk errors, overheating, unstable voltage, or similar system problems on the host computer.
ru: Это часто указывает на то, что главный компьютер перегружен. Проверьте, нет ли других процессов, потребляющих чрезмерное процессорное время, высокой загрузки подкачки, ошибок на диске, перегрева, нестабильного напряжения или аналогичных системных проблем на главном компьютере.

source: This is generally indicative of an intermittent communication failure between micro-controller and host.
ru: Обычно это указывает на прерывистый сбой связи между микроконтроллером и хостом.

source: This generally occurs when a heater temperature exceeds its configured min_temp or max_temp.
ru: Обычно это происходит, когда температура нагревателя превышает заданное значение min_temp или max_temp.

source: This generally occurs when the micro-controller has been requested to step at a rate higher than it is capable of obtaining.
ru: Обычно это происходит, когда микроконтроллеру было предложено выполнять действия со скоростью, превышающей ту, которую он способен получить.

source: This generally occurs in response to an M112 G-Code command or in response to an internal error in the host software.
ru: Обычно это происходит в ответ на команду G-кода M112 или в ответ на внутреннюю ошибку в программном обеспечении хоста.

source: Unknown value '%s' in enumeration '%s'
ru: Неизвестное значение '%s' в перечислении '%s'

source: Invalid output format for '%s'
ru: Недопустимый формат вывода для '%s'

source: Extra data at end of message
ru: Дополнительные данные в конце сообщения

source: Unknown command: %s
ru: Неизвестная команда: %s

source: Command format mismatch: %s vs %s
ru: Несоответствие формата команды: %s vs %s

source: Unable to extract params from: %s
ru: Не удается извлечь параметры из: %s

source: Unable to encode: %s
ru: Не удается закодировать: %s

source: Multi-byte msgtag not supported
ru: Многобайтовый msgtag не поддерживается

source: Error during identify: %s
ru: Ошибка при идентификации: %s

source: Firmware constant '%s' not found
ru: Константа прошивки '%s' не найдена

source: Unable to parse firmware constant %s: %s
ru: Не удается разобрать константу прошивки %s: %s

source: Pin %s reserved for %s - can't reserve for %s
ru: Pin %s зарезервирован для %s - невозможно зарезервировать для %s

source: Alias %s mapped to %s - can't alias to %s
ru: Псевдоним %s сопоставлен с %s - невозможно присвоить псевдоним %s

source: Invalid pin alias '%s'
ru: Недопустимый псевдоним '%s'

source: pin %s is an alias for %s
ru: pin %s - это псевдоним для %s

source: pin %s is reserved for %s
ru: pin %s зарезервирован для %s

source: Unknown pin chip name '%s'
ru: Неизвестный pin chip '%s'

source: Invalid pin description '%s' Format is: %s[chip_name:] pin_name
ru: Недопустимое описание pin '%s' Формат: %s[chip_name:] pin_name

source: pin %s used multiple times in config
ru: pin %s используется несколько раз в конфигурации

source: Shared pin %s must have same polarity
ru: Общий pin %s должен иметь одинаковую полярность

source: Unknown chip name '%s'
ru: Неизвестное имя чипа "%s"

source: Duplicate chip name '%s'
ru: Дублирующееся имя чипа '%s'

source: Invalid CAN uuid
ru: Недопустимый CAN uuid

source: Unable to connect
ru: Не удается подключиться

source: Serial connection closed
ru: Последовательное соединение закрыто

source: Unable to obtain '%s' response
ru: Не удалось получить ответ "%s"

source: Stepper dir pin must be on same mcu as step pin
ru: Dir pin шагового двигателя должен быть подключен к тому же mcu, что и step pin

source: Internal error in stepcompress
ru: Внутренняя ошибка при stepcompress

source: position_endstop in section '%s' must be between position_min and position_max
ru: position_endstop в разделе '%s' должен находиться между position_min и position_max

source: Unable to infer homing_positive_dir in section '%s'
ru: Не удается определить homing_positive_dir в разделе '%s'

source: Invalid homing_positive_dir / position_endstop in '%s'
ru: Недопустимый homing_positive_dir / position_endstop в '%s'

source: Pinter rail %s shared endstop pin %s must specify the same pullup/invert settings
ru: Рейки принтера %s с общим endstop pin %s должен указывать те же настройки подтягивания/инвертирования

source: Move out of range
ru: Движение выходит за установленные пределы

source: Error loading kinematics '%s'
ru: Ошибка загрузки кинематики '%s'

source: Exception in flush_handler
ru: Исключение в flush_handler

source: Set printer velocity limits
ru: Установить ограничения скорости принтера

source: Invalid M204 command "%s"
ru: Недопустимая команда M204 "%s"

source: Not a top-level dictionary
ru: Не словарь верхнего уровня

source: Invalid request type
ru: Недопустимый тип запроса

source: Missing Argument [%s]
ru: Пропущенный аргумент [%s]

source: Invalid Argument Type [%s]
ru: Недопустимый тип аргумента [%s]

source: Multiple calls to send not allowed
ru: Отправка нескольких вызовов не разрешена

source: webhooks: Unable to delete socket file '%s'
ru: webhooks: Не удается удалить файл сокета '%s'

source: Internal Error on WebRequest: %s
ru: Внутренняя ошибка при веб-запросе: %s

source: webhooks: socket write error %d
ru: webhooks: ошибка записи в сокет %d

source: Path already registered to an endpoint
ru: Путь уже зарегистрирован

source: mux endpoint %s %s %s may have only one key (%s)
ru: mux endpoint %s %s %s может иметь только один ключ (%s)

source: mux endpoint %s %s %s already registered (%s)
ru: mux endpoint %s %s %s уже зарегистрирована (%s)

source: Shutdown due to webhooks request
ru: Завершение работы из-за запроса

source: webhooks: No registered callback for path '%s'
ru: webhooks: Нет зарегистрированного коллбэка для пути '%s'

source: Remote method '%s' not registered
ru: Remote method '%s' не зарегистрирован

source: No active connections for method '%s'
ru: Нет активных подключений для метода '%s'

source: Invalid argument
ru: Недопустимый аргумент

source: Must home axis first
ru: Неизвестны начальные координаты. Нажмите кнопку Дом

source: Set which carriage is active
ru: Установите, какая каретка активна

source: '%s' is not a valid extruder.
ru: '%s' - неверное имя экструдера.

source: Set pressure advance parameters
ru: Установить параметры pressure advance

source: Active extruder does not have a stepper
ru: Активный экструдер не оснащен шаговиком

source: Unable to infer active extruder stepper
ru: Невозможно определить активный шаговый двигатель экструдера

source: Set extruder rotation distance
ru: Установить дистанцию вращения экструдера

source: Rotation distance can not be zero
ru: Дистанция вращения не может быть 0

source: Extruder '%s' rotation distance set to %0.6f
ru: Экструдер '%s': дистанция вращения установлена на %0.6f

source: Set extruder stepper motion queue
ru: Установить очередь шагового перемещения экструдера

source: Extruder '%s' now syncing with '%s'
ru: Экструдер '%s' синхронизирован с '%s'

source: Set extruder step distance
ru: Установить длину шага экструдера

source: Extruder '%s' step distance set to %0.6f
ru: Экструдер '%s': длина шага установлена на %0.6f

source: Set extruder stepper
ru: Установить шаговый двигатель экструдера

source: Extrude below minimum temp See the 'min_extrude_temp' config option for details
ru: Выдавливание при температуре ниже допустимой Смотрите опцию конфигурации 'min_extrude_temp' для деталей

source: Extrude only move too long (%.3fmm vs %.3fmm) See the 'max_extrude_only_distance' configoption for details
ru: Слишком длинная экструзия (%.3fмм против %.3fмм) Смотрите опцию конфигурации 'max_extrude_only_distance' для деталей

source: Move exceeds maximum extrusion (%.3fmm^2 vs %.3fmm^2) See the 'max_extrude_cross_section' config option for details
ru: Движение превышает максимальную экструзию (%.3fмм^2 против %.3fмм^2) Смотрите опцию конфигурации 'max_extrude_cross_section' для деталей

source: Extruder not configured, printing will continue without switching the extruder
ru: Экструдер не сконфигурирован, печать продолжится без переключения экструдера

source: Change the active extruder
ru: Измените активный экструдер

source: Extruder %s already active
ru: Экструдер %s уже активен

source: Activating extruder %s
ru: Активация экструдера %s

source: Extrude when no extruder present
ru: Выдавливать при отсутствии экструдера

source: vref and vssa must be on same mcu
ru: vref и vssa должны быть на одном mcu

source: adc_scaled only supports adc pins
ru: adc_scaled поддерживается только adc пинами

source: duplicate value
ru: дублирующее значение

source: need at least two samples
ru: необходимо как минимум два сэмпла

source: adc_temperature %s in heater %s
ru: adc_temperature %s в нагревателе %s

source: SAVE_CONFIG command will update %s configuration with offset = %s parameter
ru: Команда SAVE_CONFIG обновит конфигурацию %s с отступом = %s параметр

source: SAVE_CONFIG command will also update %s configuration with axes_transform = %s
ru: Команда SAVE_CONFIG также обновит конфигурацию %s с axes_transform = %s

source: Measuring freefall acceleration
ru: Измерение ускорения свободного падения

source: No accelerometer measurements found
ru: Измерения акселерометра не обнаружены

source: Writing raw debug accelerometer data to %s file
ru: Запись необработанных данных акселерометра в файл %s

source: WARNING: detected %d accelerometer reading errors. This may be caused by electromagnetic interference on the cables or problems with the sensor. This may severerly impact the calibration and resonance testing results.
ru: ПРЕДУПРЕЖДЕНИЕ: обнаружены ошибки в показаниях акселерометра %d. Это может быть вызвано электромагнитными помехами на кабелях или проблемами с датчиком. Это может серьезно повлиять на результаты калибровки и резонансных испытаний.

source: WARNING: detected %d accelerometer queue overflows. This may happen if the accelerometer is connected to a slow board that cannot read data fast enough, or in case of communication errors. This may severerly impact the calibration and resonance testing results.
ru: ПРЕДУПРЕЖДЕНИЕ: обнаружено переполнение очереди акселерометра %d. Это может произойти, если акселерометр подключен к медленной плате, которая не может считывать данные достаточно быстро, или в случае ошибок связи. Это может серьезно повлиять на результаты калибровки и резонансных испытаний.

source: WARNING: large acceleration reading detected (%.1f mm/sec^2). This generally indicates communication errors with the accelerometer (e.g. because of electromagnetic interference on the cables or problems with the sensor). This may severerly impact the calibration and resonance testing results.
ru: ПРЕДУПРЕЖДЕНИЕ: обнаружено большое значение ускорения (%.1f мм/сек^2). Обычно это указывает на ошибки связи с акселерометром (например, из-за электромагнитных помех на кабелях или проблем с датчиком). Это может серьезно повлиять на результаты калибровки и резонансных испытаний.

source: WARNING: strong periodic noise detected at %.1f Hz. This could be a loud unbalanced fan or some other devices working nearby. Please turn off fans (e.g. hotend fan) and other sources of vibrations for accelerometer calibration and resonance testing for best results.
ru: ПРЕДУПРЕЖДЕНИЕ: обнаружен сильный периодический шум на частоте %.1f Гц. Это может быть громкий несбалансированный вентилятор или какие-то другие устройства, работающие поблизости. Пожалуйста, выключите вентиляторы (например, вентилятор hotend) и другие источники вибраций для калибровки акселерометра и тестирования резонанса для достижения наилучших результатов.

source: %s is defunct: measured invalid freefall accel %.3f (mm/sec^2) vs ~ %.3f (mm/sec^2)
ru: %s не работает: измерено недопустимое ускорение свободного падения %.3f (мм/сек ^2) против ~ %.3f (мм/сек^ 2)

source: Accelerometer noise: %s (coefficients of variance)
ru: Шум акселерометра: %s (коэффициенты дисперсии)

source: Detected freefall acceleration %.2f mm/sec^2 in the direction: %s
ru: Обнаружено ускорение свободного падения %.2f мм/сек^2 в направлении: %s

source: Calibrating %s axis
ru: Калибровка оси %s

source: %s measured spurious acceleration on %s axis: %.3f vs %.3f (mm/sec^2)
ru: %s измеренное паразитное ускорение по оси %s: %.3f против %.3f (мм/сек^2)

source: Detected %s direction: %s
ru: Обнаружено %s направление: %s

source: %s is not kinematically connected to the movement of %s axis
ru: %s кинематически не подключен с перемещением оси%s

source: %s is not kinematically connected to either of X or Y printer axis, impossible to calibrate automatically. Please manually set axes_map parameter.
ru: %s кинематически не подключен ни к оси X, ни к оси Y принтера, автоматическая калибровка невозможна. Пожалуйста, вручную установите параметр axes_map.

source: Detected angle between X and Y axes is %.2f degrees
ru: Обнаруженный угол между осями X и Y составляет %.2f градусов

source: Computing axes transform
ru: Вычисление "axes transform"

source: Start/stop accelerometer
ru: Старт/Стоп акселерометра

source: adxl345 measurements started
ru: adxl345 - начало измерений

source: Invalid adxl345 NAME parameter
ru: Неверный параметр NAME в adxl345

source: Writing raw accelerometer data to %s file
ru: Запись необработанных данных акселерометра в файл %s

source: Query accelerometer for the current values
ru: Запрос у акселерометра текущих значений

source: No adxl345 measurements found
ru: Измерения adxl345 не найдены

source: adxl345 values (x, y, z): %.6f, %.6f, %.6f
ru: adxl345 значения (x, y, z): %.6f, %.6f, %.6f

source: Automatically calibrate accelerometer
ru: Автоматически калибрует акселерометр

source: Invalid OUTPUT parameter
ru: Неверный OUTPUT параметр

source: Query adxl345 register (for debugging)
ru: Запросить регистр adxl345 (для отладки)

source: Set adxl345 register (for debugging)
ru: Установить регистр adxl345 (для отладки)

source: Invalid adxl345 axes_map parameter
ru: Недопустимый параметр в adxl345 axes_map

source: Invalid rate parameter: %d
ru: Недопустимый параметр скорости: %d

source: Failed to set ADXL345 register [0x%x] to 0x%x: got 0x%x. This is generally indicative of connection problems (e.g. faulty wiring) or a faulty adxl345 chip.
ru: Не удалось установить для регистра ADXL345 [0x%x] значение 0x%x: получено значение 0x%x. Как правило, это указывает на проблемы с подключением (например, неисправность проводки) или неисправный чип adxl345.

source: Unable to query adxl345 fifo
ru: Не удается запросить adxl345 fifo
